Resources/DigitalWindTunnel/Openfoam_digital_twin/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    inlet         
    {
        type            turbulentDFMInlet;
        filterType      exponential;
        filterFactor    4;
        value           $internalField;
        periodicInZ     true;
    }

    outlet
    {
    	type            inletOutlet;
    	inletValue      uniform (0 0 0);
    	value           $internalField;
    }

    bottom
    {
        type            noSlip;
    }

    top
    {
        type    symmetryPlane;
    }
    
    leftWall
    {
        type    symmetryPlane;
    }

    rightWall
    {
        type    symmetryPlane;
    }

    building
    {
        type    noSlip;
    }
}

// ************************************************************************* //
