Resources/DigitalWindTunnel/Openfoam_digital_twin/0/fmm
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      fmm;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 4 -4 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1;
    }

    outlet
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      uniform 0;
    }

    bottom
    {
        type            zeroGradient;
    }

    top
    {
        type    symmetryPlane;
    }
    
    leftWall
    {
        type    symmetryPlane;
    }

    rightWall
    {
        type    symmetryPlane;
    }

    building
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
