Resources/DigitalWindTunnel/Openfoam_digital_twin/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          12400;
        startFace       7382795;
    }
    outlet
    {
        type            patch;
        nFaces          12400;
        startFace       7395195;
    }
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          20000;
        startFace       7407595;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          19999;
        startFace       7427595;
    }
    leftWall
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          24800;
        startFace       7447594;
    }
    rightWall
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          24800;
        startFace       7472394;
    }
    building
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          5;
        startFace       7497194;
    }
)

// ************************************************************************* //
