Resources/DigitalWindTunnel/Openfoam_digital_twin/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (15 0 0)
    (15.1 0 0)
    (20 0 0)
    (0 5 0)
    (15 5 0)
    (15.1 5 0)
    (20 5 0)
    (0 5.1 0)
    (15 5.1 0)
    (15.1 5.1 0)
    (20 5.1 0)
    (0 10 0)
    (15 10 0)
    (15.1 10 0)
    (20 10 0)

    (0 0 0.001)
    (15 0 0.001)
    (15.1 0 0.001)
    (20 0 0.001)
    (0 5 0.001)
    (15 5 0.001)
    (15.1 5 0.001)
    (20 5 0.001)
    (0 5.1 0.001)
    (15 5.1 0.001)
    (15.1 5.1 0.001)
    (20 5.1 0.001)
    (0 10 0.001)
    (15 10 0.001)
    (15.1 10 0.001)
    (20 10 0.001)

    (0 0 2.1437)
    (15 0 2.1437)
    (15.1 0 2.1437)
    (20 0 2.1437)
    (0 5 2.1437)
    (15 5 2.1437)
    (15.1 5 2.1437)
    (20 5 2.1437)
    (0 5.1 2.1437)
    (15 5.1 2.1437)
    (15.1 5.1 2.1437)
    (20 5.1 2.1437)
    (0 10 2.1437)
    (15 10 2.1437)
    (15.1 10 2.1437)
    (20 10 2.1437)

    (0 0 5)
    (15 0 5)
    (15.1 0 5)
    (20 0 5)
    (0 5 5)
    (15 5 5)
    (15.1 5 5)
    (20 5 5)
    (0 5.1 5)
    (15 5.1 5)
    (15.1 5.1 5)
    (20 5.1 5)
    (0 10 5)
    (15 10 5)
    (15.1 10 5)
    (20 10 5)
);

blocks
(
    hex (0 1 5 4 16 17 21 20) (150 50 1) simpleGrading (1 1 1)
    hex (1 2 6 5 17 18 22 21) (1 50 1) simpleGrading (1 1 1)
    hex (2 3 7 6 18 19 23 22) (49 50 1) simpleGrading (1 1 1)
    hex (4 5 9 8 20 21 25 24) (150 1 1) simpleGrading (1 1 1)
    hex (6 7 11 10 22 23 27 26) (49 1 1) simpleGrading (1 1 1)
    hex (8 9 13 12 24 25 29 28) (150 49 1) simpleGrading (1 1 1)
    hex (9 10 14 13 25 26 30 29) (1 49 1) simpleGrading (1 1 1)
    hex (10 11 15 14 26 27 31 30) (49 49 1) simpleGrading (1 1 1)

    hex (16 17 21 20 32 33 37 36) (150 50 95) simpleGrading (1 1 103.0347)
    hex (17 18 22 21 33 34 38 37) (1 50 95) simpleGrading (1 1 103.0347)
    hex (18 19 23 22 34 35 39 38) (49 50 95) simpleGrading (1 1 103.0347)
    hex (20 21 25 24 36 37 41 40) (150 1 95) simpleGrading (1 1 103.0347)
    hex (21 22 26 25 37 38 42 41) (1 1 95) simpleGrading (1 1 103.0347)
    hex (22 23 27 26 38 39 43 42) (49 1 95) simpleGrading (1 1 103.0347)
    hex (24 25 29 28 40 41 45 44) (150 49 95) simpleGrading (1 1 103.0347)
    hex (25 26 30 29 41 42 46 45) (1 49 95) simpleGrading (1 1 103.0347)
    hex (26 27 31 30 42 43 47 46) (49 49 95) simpleGrading (1 1 103.0347)

    hex (32 33 37 36 48 49 53 52) (150 50 28) simpleGrading (1 1 1)
    hex (33 34 38 37 49 50 54 53) (1 50 28) simpleGrading (1 1 1)
    hex (34 35 39 38 50 51 55 54) (49 50 28) simpleGrading (1 1 1)
    hex (36 37 41 40 52 53 57 56) (150 1 28) simpleGrading (1 1 1)
    hex (37 38 42 41 53 54 58 57) (1 1 28) simpleGrading (1 1 1)
    hex (38 39 43 42 54 55 59 58) (49 1 28) simpleGrading (1 1 1)
    hex (40 41 45 44 56 57 61 60) (150 49 28) simpleGrading (1 1 1)
    hex (41 42 46 45 57 58 62 61) (1 49 28) simpleGrading (1 1 1)
    hex (42 43 47 46 58 59 63 62) (49 49 28) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (   
            (0 16 20 4)
            (4 20 24 8)
            (8 24 28 12)
            (16 32 36 20)
            (20 36 40 24)
            (24 40 44 28)
            (32 48 52 36)
            (36 52 56 40)
            (40 56 60 44)
        );
     }

    outlet
    {
        type patch;
        faces
        (   
            (3 7 23 19)
            (7 11 27 23)
            (11 15 31 27)
            (19 23 39 35)
            (23 27 43 39)
            (27 31 47 43)
            (35 39 55 51)
            (39 43 59 55)
            (43 47 63 59)
        );
     }

    top
    {
        type symmetryPlane;
        faces
        (   
            (48 49 53 52)
            (49 50 54 53)
            (50 51 55 54)
            (52 53 57 56)
            (53 54 58 57)
            (54 55 59 58)
            (56 57 61 60)
            (57 58 62 61)
            (58 59 63 62)
        );
    }

    bottom
    {
        type wall;
        faces
        (   
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
            (4 8 9 5)
            (6 10 11 7)
            (8 12 13 9)
            (9 13 14 10)
            (10 14 15 11)
        );
    }

    leftWall
    {
        type symmetryPlane;
        faces
        (   
            (0 1 17 16)
            (1 2 18 17)
            (2 3 19 18)
            (16 17 33 32)
            (17 18 34 33)
            (18 19 35 34)
            (32 33 49 48)
            (33 34 50 49)
            (34 35 51 50)
        );
    }

    rightWall
    {
        type symmetryPlane;
        faces
        (   
            (13 12 28 29)
            (14 13 29 30)
            (15 14 30 31)
            (29 28 44 45)
            (30 29 45 46)
            (31 30 46 47)
            (45 44 60 61)
            (46 45 61 62)
            (47 46 62 63)
        );
    }

    building
    {
        type wall;
        faces
        (   
            (5 9 25 21)
            (9 10 26 25)
            (10 6 22 26)
            (6 5 21 22)
            (21 25 26 22)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
